tako0910/py32f0-template/Libraries/PY32F032_HAL_Driver/Inc/py32f032_hal_comp.h
#endif /* USE_HAL_COMP_REGISTER_CALLBACKS */

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup COMP_Exported_Constants COMP Exported Constants
  * @{
  */

/** @defgroup COMP_Error_Code COMP Error Code
  * @{
  */
#define HAL_COMP_ERROR_NONE             (0x00UL)  /*!< No error */
#if (USE_HAL_COMP_REGISTER_CALLBACKS == 1)
#define HAL_COMP_ERROR_INVALID_CALLBACK (0x01UL)  /*!< Invalid Callback error */
#endif /* USE_HAL_COMP_REGISTER_CALLBACKS */
/**
  * @}
  */

/** @defgroup COMP_WindowMode COMP Window Mode
  * @{
  */
#define COMP_WINDOWMODE_DISABLE                 (0x00000000UL)         /*!< Window mode disable: Comparators instances pair COMP1 and COMP2 are independent */
#define COMP_WINDOWMODE_COMP1_INPUT_PLUS_COMMON (COMP_CSR_WINMODE | COMP_WINDOWMODE_COMP1) /*!< Window mode enable: Comparators instances pair COMP1 and COMP2 have their input plus connected together. The common input is COMP1 input plus (COMP2 input plus is no more accessible). */
#define COMP_WINDOWMODE_COMP2_INPUT_PLUS_COMMON (COMP_CSR_WINMODE | COMP_WINDOWMODE_COMP2) /*!< Window mode enable: Comparators instances pair COMP1 and COMP2 have their input plus connected together. The common input is COMP2 input plus (COMP1 input plus is no more accessible). */

/**
  * @}
  */

/** @defgroup COMP_PowerMode COMP power mode
  * @{
  */
/* Note: For the characteristics of comparator power modes                    */
/*       (propagation delay and power consumption),                           */
/*       refer to device datasheet.                                           */
#define COMP_POWERMODE_HIGHSPEED       (0x00000000UL)         /*!< High Speed */
#define COMP_POWERMODE_MEDIUMSPEED     (COMP_CSR_PWRMODE)   /*!< Medium Speed */
/**
  * @}
  */

/** @defgroup COMP_InputPlus COMP input plus (non-inverting input)
  * @{
  */ 
#define COMP_INPUT_PLUS_IO0         (0x00000000)                              /*!< Comparator input plus connected to IO0(pin PB8 for COMP1, pin PB4 for COMP2) */
#define COMP_INPUT_PLUS_IO1         (COMP_CSR_INPSEL_0)                       /*!< Comparator input plus connected to IO1(pin PB2 for COMP1, pin PB6 for COMP2) */
#define COMP_INPUT_PLUS_IO2         (COMP_CSR_INPSEL_1)                       /*!< Comparator input plus connected to IO2(pin PA1 for COMP1, pin PA3 for COMP2) */
#define COMP_INPUT_PLUS_IO3         (COMP_CSR_INPSEL_1 | COMP_CSR_INPSEL_0)   /*!< Comparator input plus connected to IO3(pin PF3 for COMP2) */
#define COMP_INPUT_PLUS_COMP1_OPA1  (COMP_CSR_INPSEL_1 | COMP_CSR_INPSEL_0)   /*!< Comparator input plus connected to COMP1_OPA1 */
#define COMP_INPUT_PLUS_COMP1_OPA2  (COMP_CSR_INPSEL_2)                       /*!< Comparator input plus connected to COMP1_OPA2 */
#define COMP_INPUT_PLUS_COMP2_OPA1  (COMP_CSR_INPSEL_2)                       /*!< Comparator input plus connected to COMP2_OPA1 */
#define COMP_INPUT_PLUS_COMP2_OPA2  (COMP_CSR_INPSEL_2 | COMP_CSR_INPSEL_0)   /*!< Comparator input plus connected to COMP2_OPA2 */

/**
  * @}
  */

/** @defgroup COMP_InputMinus COMP input minus (inverting input)
  * @{
  */
#define COMP_INPUT_MINUS_COMP1_IO0     (0x00000000UL)                                              /*!< Comparator input minus connected to IO0(pin PB1 for COMP1) */
#define COMP_INPUT_MINUS_COMP1_IO1     (                                        COMP_CSR_INMSEL_1) /*!< Comparator input minus connected to IO1(pin PA0 for COMP1) */
#define COMP_INPUT_MINUS_COMP1_OPA1    (                    COMP_CSR_INMSEL_2                    ) /*!< Comparator input minus connected to COMP1_OPA1  */ 
#define COMP_INPUT_MINUS_COMP1_VREFCMP (                    COMP_CSR_INMSEL_2 | COMP_CSR_INMSEL_1) /*!< Comparator input minus connected to COMP1_VREFCMP */
#define COMP_INPUT_MINUS_COMP1_TS_VIN  (COMP_CSR_INMSEL_3                                        ) /*!< Comparator input minus connected to COMP1_TS_VIN  */ 
#define COMP_INPUT_MINUS_COMP1_VREFINT (COMP_CSR_INMSEL_3                     | COMP_CSR_INMSEL_1) /*!< Comparator input minus connected to COMP1_VREFINT */ 
#define COMP_INPUT_MINUS_COMP1_VREFBUF (COMP_CSR_INMSEL_3 | COMP_CSR_INMSEL_2                    ) /*!< Comparator input minus connected to COMP1_VREFBUF */ 
#define COMP_INPUT_MINUS_COMP1_OPA2    (COMP_CSR_INMSEL_3 | COMP_CSR_INMSEL_2 | COMP_CSR_INMSEL_1) /*!< Comparator input minus connected to COMP1_OPA2 */


#define COMP_INPUT_MINUS_COMP2_IO0     (0x00000000)                                                                    /*!< Comparator input minus connected to IO0(PA2 for COMP2) */ 
#define COMP_INPUT_MINUS_COMP2_IO1     (                                                            COMP_CSR_INMSEL_0) /*!< Comparator input minus connected to IO1(PB7 for COMP2) */ 
#define COMP_INPUT_MINUS_COMP2_IO2     (                                        COMP_CSR_INMSEL_1                    ) /*!< Comparator input minus connected to IO2(PB3 for COMP2) */ 
#define COMP_INPUT_MINUS_COMP2_VREFCMP (                                        COMP_CSR_INMSEL_1 | COMP_CSR_INMSEL_0) /*!< Comparator input minus connected to COMP2_VREFCMP */
#define COMP_INPUT_MINUS_COMP2_TS_VIN  (                    COMP_CSR_INMSEL_2                                        ) /*!< Comparator input minus connected to COMP2_TS_VIN */ 
#define COMP_INPUT_MINUS_COMP2_VREFINT (                    COMP_CSR_INMSEL_2                     | COMP_CSR_INMSEL_0) /*!< Comparator input minus connected to COMP2_VREFINT */ 
#define COMP_INPUT_MINUS_COMP2_VREFBUF (                    COMP_CSR_INMSEL_2 | COMP_CSR_INMSEL_1                    ) /*!< Comparator input minus connected to COMP2_VREFBUF */ 
#define COMP_INPUT_MINUS_COMP2_OPA1    (                    COMP_CSR_INMSEL_2 | COMP_CSR_INMSEL_1 | COMP_CSR_INMSEL_0) /*!< Comparator input minus connected to COMP2_OPA1 */
#define COMP_INPUT_MINUS_COMP2_OPA2    (COMP_CSR_INMSEL_3                                                            ) /*!< Comparator input minus connected to COMP2_OPA2 */

/**
  * @}
  */
  
/** @defgroup COMP_VrefSrc COMP Vref Source
  * @{
  */

#define COMP_VREF_SOURCE_VCC            (COMP_CCSR_SSEL) 
#define COMP_VREF_SOURCE_VREFBUF1P024V  (VREFBUF_CR_VREFBUF_EN)                                                                   /* Vrefbuf 1.024V */  
#define COMP_VREF_SOURCE_VREFBUF1P5V    (VREFBUF_CR_VREFBUF_EN | VREFBUF_CR_VREFBUF_OUT_SEL_0)                                    /* Vrefbuf 1.5V */  
#define COMP_VREF_SOURCE_VREFBUF2P048V  (VREFBUF_CR_VREFBUF_EN | VREFBUF_CR_VREFBUF_OUT_SEL_1)                                    /* Vrefbuf 2.048V */  
/* #define COMP_VREF_SOURCE_VREFBUF0P6V    (VREFBUF_CR_VREFBUF_EN | VREFBUF_CR_VREFBUF_OUT_SEL_1 | VREFBUF_CR_VREFBUF_OUT_SEL_0) */    /* Vrefbuf 0.6V */  
/**
  * @}
  */

